// Задача: написать таблицу квадратов чисел от 1 до n

int n = Convert.ToInt32(Console.ReadLine());
for (int i = 1; i <= n; i++)
    Console.WriteLine(i + "^2 = " + i * i);

